-- 2. Подсчитайте количество дней рождения, которые приходятся на каждый из дней недели.
-- Следует учесть, что необходимы дни недели текущего года, а не года рождения.
use shop;
SELECT * FROM users;
# +----+----------+---------------------+---------------------+---------------------+
# | id | name     | birthday_at         | created_at          | updated_at          |
# +----+----------+---------------------+---------------------+---------------------+
# |  1 | Mark     | 1987-04-30 00:00:00 | 2021-09-23 00:32:07 | 2021-09-23 00:32:07 |
# |  2 | Gregory  | 1989-12-31 00:00:00 | 2021-09-23 00:32:07 | 2021-09-23 00:32:07 |
# |  3 | John     | 2001-07-28 00:00:00 | 2021-09-23 00:32:07 | 2021-09-23 00:32:07 |
# |  4 | Ben      | 1973-12-18 00:00:00 | 2021-09-23 00:32:07 | 2021-09-23 00:32:07 |
# |  5 | Benjamin | 1989-02-09 01:09:30 | 2021-09-23 00:53:32 | 2021-09-23 00:53:32 |
# |  6 | Svetlana | 1988-02-04 00:00:00 | NULL                | NULL                |
# |  7 | Oleg     | 1988-04-20 00:00:00 | NULL                | NULL                |
# |  8 | Julia    | 1989-12-31 00:00:00 | NULL                | NULL                |
# |  9 | Matt     | 2001-02-28 00:00:00 | NULL                | NULL                |
# | 10 | Julius   | 1973-12-18 23:36:32 | NULL                | NULL                |
# | 11 | Stanford | 1989-12-31 00:00:00 | NULL                | NULL                |
# | 12 | Genry    | 2001-02-28 00:00:00 | NULL                | NULL                |
# +----+----------+---------------------+---------------------+---------------------+

SELECT name, DATE_FORMAT(birthday_at, '%Y.%m.%d') as birthday, WEEK(CONCAT(YEAR(NOW()),'-',MONTH(birthday_at),'-',DAY(birthday_at))) as birthweek FROM users;
-- количество дней рождения, которые приходятся на каждый из дней недели:
SELECT
WEEK(CONCAT(YEAR(NOW()),'-',MONTH(birthday_at),'-',DAY(birthday_at))) as birthweek,
GROUP_CONCAT(name),
count(*)
FROM users
GROUP BY birthweek;

# +-----------+------------------------+----------+
# | birthweek | GROUP_CONCAT(name)     | count(*) |
# +-----------+------------------------+----------+
# |         5 | Svetlana               |        1 |
# |         6 | Benjamin               |        1 |
# |         9 | Matt,Genry             |        2 |
# |        16 | Oleg                   |        1 |
# |        17 | Mark                   |        1 |
# |        30 | John                   |        1 |
# |        50 | Ben,Julius             |        2 |
# |        52 | Gregory,Julia,Stanford |        3 |
# +-----------+------------------------+----------+