# 3. В таблице складских запасов storehouses_products в поле value могут встречаться самые разные цифры: 0, 
# если товар закончился и выше нуля, если на складе имеются запасы. Необходимо отсортировать записи таким образом, 
# чтобы они выводились в порядке увеличения значения value. Однако нулевые запасы должны выводиться в конце, после всех записей.

DROP TABLE IF EXISTS storehouses_products;

CREATE TABLE storehouses_products(
	id SERIAL PRIMARY KEY,
	name VARCHAR(255) NOT NULL,
	value INT UNSIGNED NOT NULL
);

INSERT INTO storehouses_products VALUES
	(NULL, 'сливы кг', 0),
	(NULL, 'помидоры кг', 340),
	(NULL, 'арбузы кг', 238),
	(NULL, 'кукуруза консер 250 г', 1392),
	(NULL, 'хлеб бух', 4289),
	(NULL, 'дуриан кг', 0),
	(NULL, 'хурма кг', 0),
	(NULL, 'огурцы кг', 471),
	(NULL, 'персики кг', 0),
	(NULL, 'кетчуп бут', 731);

SELECT * FROM storehouses_products;

# +----+--------------------------------------+-------+
# | id | name                                 | value |
# +----+--------------------------------------+-------+
# |  1 | помидоры кг                          |   340 |
# |  2 | арбузы кг                            |   238 |
# |  3 | кукуруза консер 250 г                |  1392 |
# |  4 | хлеб бух                             |  4289 |
# |  5 | дуриан кг                            |     0 |
# |  6 | хурма кг                             |     0 |
# |  7 | огурцы кг                            |   471 |
# |  8 | персики кг                           |     0 |
# |  9 | кетчуп бут                           |   731 |
# +----+--------------------------------------+-------+
# 9 rows in set (0,00 sec)

SELECT * FROM storehouses_products ORDER BY CASE value = 0 THEN 1 ELSE 0 end, value;
# или
SELECT * FROM storehouses_products ORDER BY IF(value=0,1,0), value;
# или
SELECT * FROM storehouses_products ORDER BY value = 0, value;

# +----+--------------------------------------+-------+
# | id | name                                 | value |
# +----+--------------------------------------+-------+
# |  3 | арбузы кг                            |   238 |
# |  2 | помидоры кг                          |   340 |
# |  8 | огурцы кг                            |   471 |
# | 10 | кетчуп бут                           |   731 |
# |  4 | кукуруза консер 250 г                |  1392 |
# |  5 | хлеб бух                             |  4289 |
# |  1 | сливы кг                             |     0 |
# |  6 | дуриан кг                            |     0 |
# |  7 | хурма кг                             |     0 |
# |  9 | персики кг                           |     0 |
# +----+--------------------------------------+-------+


