-- по желанию) Пусть имеется таблица с календарным полем created_at. 
-- В ней размещены разряженые календарные записи за август 2018 года 
-- '2018-08-01', '2016-08-04', '2018-08-16' и 2018-08-17. 
-- Составьте запрос, который выводит полный список дат за август, выставляя в соседнем поле значение 1, 
-- если дата присутствует в исходном таблице и 0, если она отсутствует.

CREATE TABLE somedates (value DATETIME NOT NULL);
INSERT INTO somedates VALUES ('2018-08-01'), ('2016-08-04'), ('2018-08-16'),('2018-08-17');

SELECT * FROM somedates;
-- +---------------------+
-- | value               |
-- +---------------------+
-- | 2018-08-01 00:00:00 |
-- | 2016-08-04 00:00:00 |
-- | 2018-08-16 00:00:00 |
-- | 2018-08-17 00:00:00 |
-- +---------------------+



DROP PROCEDURE IF EXISTS gen_august_dates;
DELIMITER //

CREATE PROCEDURE gen_august_dates ()
BEGIN
	DECLARE start_date DATETIME DEFAULT '2018-08-01';
	DROP TEMPORARY TABLE IF EXISTS aug_dates;
	CREATE TEMPORARY TABLE aug_dates (`dates` DATETIME); --  Сабина, подскажите, почему если строку кода с созданием временной таблицы поставить перед DECLARE, то код не работает?
	WHILE start_date != '2018-09-01' DO
		INSERT INTO aug_dates VALUES (start_date);
		SET start_date = start_date + INTERVAL 1 DAY;
	END WHILE;
	SELECT aug_dates.dates,
	       IF(aug_dates.dates IN (SELECT value FROM somedates), 1 , 0) AS cross_check
	FROM aug_dates;
END //

DELIMITER ;
CALL gen_august_dates();

-- ---------------------+-------------+
-- | dates               | cross_check |
-- +---------------------+-------------+
-- | 2018-08-01 00:00:00 |           1 |
-- | 2018-08-02 00:00:00 |           0 |
-- | 2018-08-03 00:00:00 |           0 |
-- | 2018-08-04 00:00:00 |           0 |
-- | 2018-08-05 00:00:00 |           0 |
-- | 2018-08-06 00:00:00 |           0 |
-- | 2018-08-07 00:00:00 |           0 |
-- | 2018-08-08 00:00:00 |           0 |
-- | 2018-08-09 00:00:00 |           0 |
-- | 2018-08-10 00:00:00 |           0 |
-- | 2018-08-11 00:00:00 |           0 |
-- | 2018-08-12 00:00:00 |           0 |
-- | 2018-08-13 00:00:00 |           0 |
-- | 2018-08-14 00:00:00 |           0 |
-- | 2018-08-15 00:00:00 |           0 |
-- | 2018-08-16 00:00:00 |           1 |
-- | 2018-08-17 00:00:00 |           1 |
-- | 2018-08-18 00:00:00 |           0 |
-- | 2018-08-19 00:00:00 |           0 |
-- | 2018-08-20 00:00:00 |           0 |
-- | 2018-08-21 00:00:00 |           0 |
-- | 2018-08-22 00:00:00 |           0 |
-- | 2018-08-23 00:00:00 |           0 |
-- | 2018-08-24 00:00:00 |           0 |
-- | 2018-08-25 00:00:00 |           0 |
-- | 2018-08-26 00:00:00 |           0 |
-- | 2018-08-27 00:00:00 |           0 |
-- | 2018-08-28 00:00:00 |           0 |
-- | 2018-08-29 00:00:00 |           0 |
-- | 2018-08-30 00:00:00 |           0 |
-- | 2018-08-31 00:00:00 |           0 |
-- +---------------------+-------------+
-- 31 rows in set (0,01 sec)
