# 5. (по желанию) Из таблицы catalogs извлекаются записи при помощи запроса. SELECT * FROM catalogs WHERE id IN (5, 1, 2); 
# Отсортируйте записи в порядке, заданном в списке IN.

SELECT * FROM catalogs;
# +----+-------------------------------------+
# | id | name                                |
# +----+-------------------------------------+
# |  1 | Процессоры                          |
# |  2 | Мат. платы                          |
# |  3 | Видеокарты                          |
# |  4 | Жетские диски                       |
# |  5 | Оперативная память                  |
# +----+-------------------------------------+
# 5 rows in set (0,00 sec)

SELECT * FROM catalogs WHERE id IN (5, 1, 2) ORDER BY CASE 
	WHEN id = 5 THEN 1
	WHEN id = 1 THEN 2
	WHEN id = 2 THEN 3
	END;
	
# +----+-------------------------------------+
# | id | name                                |
# +----+-------------------------------------+
# |  5 | Оперативная память                  |
# |  1 | Процессоры                          |
# |  2 | Мат. платы                          |
# +----+-------------------------------------+
# 3 rows in set (0,00 sec)
