-- Практическое задание теме «Агрегация данных»
-- 1. Подсчитайте средний возраст пользователей в таблице users.
SELECT * FROM users;
# +----+----------+---------------------+---------------------+---------------------+
# | id | name     | birthday_at         | created_at          | updated_at          |
# +----+----------+---------------------+---------------------+---------------------+
# |  1 | Mark     | 1987-04-30 00:00:00 | 2021-09-23 00:32:07 | 2021-09-23 00:32:07 |
# |  2 | Gregory  | 1963-10-17 00:00:00 | 2021-09-23 00:32:07 | 2021-09-23 00:32:07 |
# |  3 | John     | 2001-07-28 00:00:00 | 2021-09-23 00:32:07 | 2021-09-23 00:32:07 |
# |  4 | Ben      | 1973-12-18 00:00:00 | 2021-09-23 00:32:07 | 2021-09-23 00:32:07 |
# |  5 | Benjamin | 1989-02-09 01:09:30 | 2021-09-23 00:53:32 | 2021-09-23 00:53:32 |
# |  6 | Svetlana | 1988-02-04 00:00:00 | NULL                | NULL                |
# |  7 | Oleg     | 1988-04-20 00:00:00 | NULL                | NULL                |
# |  8 | Julia    | 1989-12-31 00:00:00 | NULL                | NULL                |
# |  9 | Matt     | 2001-02-28 00:00:00 | NULL                | NULL                |
# +----+----------+---------------------+---------------------+---------------------+

SELECT ROUND(AVG(TIMESTAMPDIFF(YEAR,birthday_at,NOW())),0) as average_age_of_users FROM users;
-- или
SELECT ROUND(AVG(DATE_FORMAT(NOW(),'%Y.%m.%d') - DATE_FORMAT(birthday_at,'%Y.%m.%d')),0) AS average_age_of_users FROM users;
